/* Boxcar email address field label */
"Email Address:" = "Adresă e-Mail:";

/* Failure adding email */
"Invalid Email" = "e-Mail invalid";

/* Checkbox for only sending if idle by growl's idle detection */
"Only send if idle:" = "Trimite doar dacă este inactiv pentru:";

/* Checkbox for sending only if priority is above a certain value */
"Only send if priority is at least:" = "Trimite doar dacă prioritatea este de cel puțin: ";

/* Prefix notifications to boxcar checkbox */
"Prefix notifications with:" = "Notificări cu prefix:";

/* Success adding boxcar */
"Registered!" = "Înregistrat!";

/* Failed adding boxcar, unknown email address */
"Unknown email" = "e-Mail necunoscut";

